#include "Main.h"

char dg = 8;

void Port_init(void)
{


}



int main(void)
{
    Port_init();
	//LCDinit();
	//LCDclear();
	//LCDstringXY("Hello World",0,0);
	//-----------------инициализация SPI--------------------
	//SPI_Master_Init(MASTER,DEL_16);
	SPI_INICILIZER();
	//------------------------------------------------------
	

	//-----------------Работа с  микросхемой MAX7219----------------------
	//Send_MAX7219(0x09,0xFF);//включим режим декодирования
	//Send_MAX7219(0x0B, dg-1); //сколько разрядов используем
	//Send_MAX7219(0x0A,0x07);	//яркость свечения индикатора
	//Send_MAX7219(0x0C,1);		//включим индикатор
	//Clear_7219(dg);
	//Send_MAX7219(0x01, 1);
	//Send_MAX7219(0x02, 2);
	//Send_MAX7219(0x03, 3);
	//Send_MAX7219(0x04, 4);
	//Send_MAX7219(0x05, 5);
	//Send_MAX7219(0x06, 6);
	//Send_MAX7219(0x07, 7);
	//Send_MAX7219(0x08, 8);
	//Send_MAX7219(0x0A, 0x02); //яркость
    //_delay_ms(1000);
//
    //Number_MAX7219(-2016);
	//----------------------------------------------
	//float data=0;		//Переменные для работы с АЦП
	//char str[100]={0};//Переменные для работы с АЦП

	float Vop;			//Опорное напряжение
	float Vnov;			//Выходное напряжение
	float  Vshag;		//шаг изменения напряжения
	Vop=4.4; 
	Vnov=0;
	 Vshag =0.1;
	

	while (1) 
    {
		//-------------------Проверка сдвигового регистра 74hc595-------------
		//for(uint8_t i=0; i<255;i++)
		//{
//
		//SPi_Transmit_data(i);
		//_delay_ms(550);
		//}


		//--------------------------------------------------------------------
		//--------------------------Работа с внешним АЦП MCP3201-------------------
		
		//data=Convert_3201(Read_3201());
		//
		//sprintf(str,"Voltage= %.2fv",data);
		//LCDstringXY(str,1,1);
		//_delay_ms(500);
		//LCDclear();

		//-------------------------------------------------------------------------

		//----------------------------Работа с ЦАП MCP4921------------------------

		MCP4921_Sent_Data(MCP_4921_Convert_Data(Vnov,Vop));
		Vnov+=Vshag;
		if (Vnov==4.6)
		{
			Vnov=0;

		}
		_delay_ms(2000);


		//------------------------------------------------------------------------
		
		
    }
}

