
//-------------------------------------------------<                axlib v1.1                 >----------------------------------------------------
//-------------------------------------------------<  Основной файл с изменяемыми параметрами  >----------------------------------------------------
//-------------------------------------------------< Кузнецов Алексей 2015 http://www.avrki.ru >----------------------------------------------------

#ifndef MAIN_INIT_H_
#define MAIN_INIT_H_

// Частота CPU
#define F_CPU 800000UL

// Подключение необходимых библиотек
#include <util/delay.h>
#include "axlib/type_var.h"

#define FULL	0xFF


// Активация TFT дисплея ST7735
#define DDR_CS		DDRD	// Порт на котором будет CS
#define DDR_A0		DDRD	// Порт на котором будет A0
#define DDR_RES		DDRD	// Порт на котором будет RES

#define PORT_CS		PORTD	// Порт на котором будет CS
#define PORT_A0		PORTD	// Порт на котором будет A0
#define PORT_RES	PORTD	// Порт на котором будет RES

#define CS			2		// Пин на котором будет CS
#define A0			3		// Пин на котором будет A0
#define RES			7		// Пин на котором будет RES

#endif /* MAIN_INIT_H_ */