#include "lcd.h"
//#include "Fonts.h"


//-------------------------------------------------------------------------
//	Функция разбора и вывода полубайта по пинам
//	Получаемый аргумент:
//			char data
//			Полубайт требуемый вывода
//-------------------------------------------------------------------------
void lcd_out(char data)
{
	if(data & 0x01)
	{
		PORT_D4|= (1<<D4);
	}
	else
	{
		PORT_D4&= ~(1<<D4);
	}
	if(data & 0x02)
	{
		PORT_D5|= (1<<D5);
	}
	else
	{
		PORT_D5&= ~(1<<D5);
	}
	if(data & 0x04)
	{
		PORT_D6|= (1<<D6);
	}
	else
	{
		PORT_D6 &= ~(1 << D6);
	}
	if(data & 0x08)
	{
		PORT_D7|= (1<<D7);
	}
	else
	{
		PORT_D7&= ~(1<<D7);
	}
}


//-------------------------------------------------------------------------
//	Функция передачи команды в дисплей
//	Получаемый аргумент:
//			char com
//			Команда
//-------------------------------------------------------------------------
void lcd_com(char com)
{
	RS_COM();				// Вывод команды
	lcd_out(com);			// Вывод данных на пины
	E_SET();				// Выставить Е
	E_RESET();				// Сбросить Е
	_delay_ms(4);			// После команды пауза
}

//-------------------------------------------------------------------------
//	Функция инициализации дисплея
//	Получаемые аргументы:
//			char lcd
//			0 - Позиция левый верхний угол, курсор не выводится
//			1 - Позиция левый верхний угол, курсор мигает в виде всего символа
//			2 - Позиция левый верхний угол, курсор в виде подчеркивания
//			3 - Позиция левый верхний угол, курсор в виде подчеркивания и мигает символ
//-------------------------------------------------------------------------

void lcd_init(char lcd)
{
	DDR_RS|= (1<<RS);
	DDR_RW|=(1<<RW);
	DDR_E |= (1<<E);
	DDR_D4|= (1<<D4);
	DDR_D5|= (1<<D5);
	DDR_D6|= (1<<D6);
	DDR_D7|= (1<<D7);
	switch (lcd)
	{
		case 0: lcd = 0x0C; break;
		case 1: lcd = 0x0D; break;
		case 2: lcd = 0x0E; break;
		case 3: lcd = 0x0F; break;
	}

	_delay_ms(20);		// После включения питания подождать 20 мс
	
	lcd_com(0x03);		// Переход в 4-х битный режим
	_delay_us(40);
	lcd_com(0x03);		// Переход в 4-х битный режим
	_delay_us(40);
	lcd_com(0x03);		// Переход в 4-х битный режим
	_delay_us(40);
	lcd_com(0x02);		// Переход в 4-х битный режим
	_delay_us(40);
	lcd_com(0x02);		// Установка параметров
	lcd_com(0x08);		// Установка параметров
	lcd_com(0x00);		// Выключаем дисплей
	lcd_com(0x08);		// Выключаем дисплей
	lcd_com(0x00);		// Очищаем дисплей
	lcd_com(0x01);		// Очищаем дисплей
	lcd_com(0x00);		// Устанавливаем режим ввода данных
	lcd_com(0x06);		// Устанавливаем режим ввода данных
	lcd_com(0x00);		// Включаем дисплей с выбранным курсором
	lcd_com(lcd);		// Включаем дисплей с выбранным курсором
}


//-------------------------------------------------------------------------
//	Функция отправки байта данных дисплею
//	Принимаемый аргумент:
//			char data
//			Передаваемый байт
//-------------------------------------------------------------------------
void lcd_char_out(char data)
{
	RS_DATA();							// Передача данных
	lcd_out(data >> 4);					// Передача старших 4 бит
	E_SET();
	E_RESET();
	lcd_out(data & 0x0F);				// Передача младших 4 бит
	E_SET();
	E_RESET();
	_delay_ms(4);						// После командная пауза
}

//-------------------------------------------------------------------------
//	Функция вывода строки
//	Принимаемый аргумент:
//			char *str
//			Указатель на массив заканчивающийся нулевым символом.
//-------------------------------------------------------------------------
void lcd_str_out(char *str)
{
	while((*str) != '\0')
	{
		lcd_char_out(*str);
		str++;
	}
}

//-------------------------------------------------------------------------
//	Функция переводит курсор по осям X, Y
//	Получаемые аргументы:
//			char x, char y
//			х - значение от 0 до 39. Длинна строки
//			y - значение от 0 до 3.  Номер строки
//-------------------------------------------------------------------------
void lcd_gotoxy(char x, char y)
{
	if(x > 39) x = 39;
	if(x < 0) x = 0;
	if(y > 3) y = 3;
	if(y < 0) y = 0;
	
	char temp = 0x00;

	RS_COM();
	
	switch (y)
	{
		case 0:
		{
			temp |= (0x80 + x);
			lcd_com(temp >> 4);			// Передача старших 4 бит
			lcd_com(temp & 0x0F);		// Передача младших 4 бит
			break;
		}
		case 1:
		{
			temp |= (0xC0 + x);
			lcd_com(temp >> 4);			// Передача старших 4 бит
			lcd_com(temp & 0x0F);		// Передача младших 4 бит
			break;
		}
		case 2:
		{
			temp |= (0x94 + x);
			lcd_com(temp >> 4);			// Передача старших 4 бит
			lcd_com(temp & 0x0F);		// Передача младших 4 бит
			break;
		}
		case 3:
		{
			temp |= (0xD4 + x);
			lcd_com(temp >> 4);			// Передача старших 4 бит
			lcd_com(temp & 0x0F);		// Передача младших 4 бит
			break;
		}
	}

}

void lcd_printStringXY(char *str,char x,char y)
{
	lcd_gotoxy(x,y);
	lcd_str_out(str);
}


//-------------------------------------------------------------------------
//	Функция очистки дисплея и установки курсора на 0 строку, 0 символ
//-------------------------------------------------------------------------
void lcd_clear(void)
{
	lcd_com(0x00);
	lcd_com(0x01);
}



//-------------------------------------------------------------------------
//	Функция создания и записи в память своего символа
//	Передаваемые аргументы:
//		char simbol - Адрес в CGRAM от 0 до 15
//		char *str - Указатель на начало массива с байтами символа
//-------------------------------------------------------------------------
void lcd_simbol(char simbol, char *str)
{
	simbol = (8 * simbol) | 0x40;
	lcd_com(simbol >> 4);
	lcd_com(simbol & 0x0F);
	for(char i = 0; i <= 7; i++)
	{
		lcd_char_out(*str);
		str++;
	}
	
	lcd_gotoxy(0,0);

}


void LCD_PrintLongStrring(char str1[])
{
	unsigned char n;
	lcd_com(0x80);//1 строка
	for(n=0;n<=19;n++)
	lcd_char_out(str1[n]);
	for(n=40;n<=59;n++)//на 3ю строку перейдём автоматически в силу организации DDRAM дисплея
	lcd_char_out(str1[n]);
	lcd_com(0xC0);//2 строка
	for(n=20;n<=39;n++)
	lcd_char_out(str1[n]);
	for(n=60;n<=79;n++)//на 4ю строку перейдём автоматически в силу организации DDRAM дисплея
	lcd_char_out(str1[n]);



}


 