/*
 * _1WiRe.h
 *
 * Created: 26.02.2018 15:18:49
 *  Author: Dante_L_Levi
 */ 


#ifndef ONEWIRE_H_
#define ONEWIRE_H_


#include "Main.h"


#define PORT_DQ PORTB
#define DDR_DQ DDRB
#define PIN_DQ PINB 
#define Pin_Data PB0


#define OWIRE_0 DDR_DQ|=(1<<Pin_Data);
#define OWIRE_1 DDR_DQ&=~(1<<Pin_Data);


//-------------------------------------------------------------------------
//	--------------------Функция инициализации 1ware.------------------------
//	Возвращает 1 если присутствует устройство на шине, иначе 0
//
//-------------------------------------------------------------------------
uint8_t OneWire_Init(void);



//-------------------------------------------------------------------------
//	---------------Функция передачи байта в шину 1ware.------------------------
//
//	Принимает аргументы:
//
//		BYTE b - Байт который необходимо отправить по шине
//-------------------------------------------------------------------------
void OWire_Write(uint8_t b);

//-------------------------------------------------------------------------
//	----------------Функция чтения бита из шины.--------------------------
//	Возвращает текущее значение бита
//
//-------------------------------------------------------------------------
uint8_t OWire_Read_Bit(void);



//-------------------------------------------------------------------------
//	-------------------Функция чтения байта из шины.-----------------------
//	Возвращает прочитанный байт
//
//-------------------------------------------------------------------------
uint8_t OWire_read(void);


#endif /* ONEWIRE_H_ */