#include "OneWire.h"

//-------------------------------------------------------------------------
//	--------------------Функция инициализации 1ware.------------------------
//	Возвращает 1 если присутствует устройство на шине, иначе 0
//
//-------------------------------------------------------------------------
uint8_t OneWire_Init(void)
{
	
	uint8_t SREG_SAVE=SREG;
	cli();
	uint8_t i,j;
	OWIRE_0;
	_delay_us(480);
	OWIRE_1;
	_delay_us(2);

	for (i=0;i<100;i++)
	{
		if (!(PIN_DQ&(1<<Pin_Data)))
		{
			for (j=1;j!=0;j++)
			{
				if (PIN_DQ&(1<<Pin_Data))
				{
					break;
				}
				_delay_us(1);
			}

			SREG = SREG_SAVE;
			sei();
			if(j)return 1; //инициализация успешна
			else return 0;	// если уровень так и не подняли, то опустило его не устройство.
		}
		_delay_us(1);	
	}
	SREG = SREG_SAVE;
	sei();
	return 0;
}


//-------------------------------------------------------------------------
//	---------------Функция передачи байта в шину 1ware.------------------------
//
//	Принимает аргументы:
//
//		BYTE b - Байт который необходимо отправить по шине
//-------------------------------------------------------------------------
void OWire_Write(uint8_t b)
{
	cli();
	uint8_t temp,i;

	for(i=0; i<8; i++)
	{
		temp=(b&0x01);
		if(temp)
		{
			OWIRE_0;
			_delay_us(6);
			OWIRE_1;
			_delay_us(64);
		}
		else
		{
			OWIRE_0;
			_delay_us(60);
			OWIRE_1;
			_delay_us(10);
		}
		b>>=1;
	}
	sei();
	
}

//-------------------------------------------------------------------------
//	----------------Функция чтения бита из шины.--------------------------
//	Возвращает текущее значение бита
//
//-------------------------------------------------------------------------
uint8_t OWire_Read_Bit(void)
{
	cli();	
	uint8_t bit;
	OWIRE_0;
	_delay_us(2);
	OWIRE_1;
	_delay_us(5);
	bit=PIN_DQ&(1<<Pin_Data);
	_delay_us(80);
	sei();
	return bit;

}

//-------------------------------------------------------------------------
//	-------------------Функция чтения байта из шины.-----------------------
//	Возвращает прочитанный байт
//
//-------------------------------------------------------------------------
uint8_t OWire_read(void)
{
	cli();
	uint8_t byte=0;
	uint8_t i=0;
	for (i=0; i<8; i++)
	{
		byte >>= 1;
		if (OWire_Read_Bit())
		byte |= 0x80;
	}
	sei();
	return byte;
}





