/*============================================Библиотека для работы с Аналогово-цифровым преобразователем===================
 
 *
 *
 *=======================================================Автор: Лепотенко А.С.========================================================
 */ 


#ifndef ADCLIB_H_
#define ADCLIB_H_

#include "Main.h"
#include <stdlib.h>
#include <stdio.h>
#include <avr/interrupt.h>
#include "LM35lib.h"


//-------------------------------------------------------------------------
//							Инициализация переменных
//-------------------------------------------------------------------------


//-------------------------------------------------------------------------
//							Объявление псевдонимов
//-------------------------------------------------------------------------

#define ADC_IREF_ON		0xC0
#define ADC_IREF_OFF	0x40

#define ADD_MASK		0x07

#define ADC_CH_0		0
#define ADC_CH_1		1
#define ADC_CH_2		2
#define ADC_CH_3		3
#define ADC_CH_4		4
#define ADC_CH_5		5
#define ADC_CH_6		6
#define ADC_CH_7		7


#define FLAG_INNER_AREF 1
#define FLAG_EXTERN_AREF 2
 


//---------------------------------------------------------------------
//							Прототипы функций
//---------------------------------------------------------------------
void adc_init(unsigned char flag,float uaref);
unsigned int adc_data(unsigned char ch);
float adc_voltage(unsigned char ch);


//---------------------------------------------------------------------

#endif /* ADCLIB_H_ */